erpdev.СХК_Расширение/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5674c843-2642-4871-9160-0d93006f0add">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8b15-f8e1-48f5-a895-0a0068c7711a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9965e1bc-ce9d-4432-8e20-794e5ead177a">
    <name>ВариантОбособления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="15fca05d-7959-4a2b-9062-e424f3982539">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25c088f7-7f66-4e72-9549-39343550e4b5">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f1e30099-86a8-4d01-b947-c8d4e48da517">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff56eabe-a6d5-4725-a7e1-6d3c1cffefbc">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1c87bbe-4236-4da6-901a-bda05277a9f2">
    <name>РазмещениеВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0dd02b32-fdf8-46a0-b121-bd1aed1c77f6">
    <name>ТипПроизводственногоПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f569d9b-0875-46e5-af66-0afc714c2046">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5386e5e0-cdc1-4016-a59f-f459a6745b05">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0def1be0-f815-4bbb-a4d3-dbc07cf4d5f6">
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d77a8d5f-e794-448d-9882-9f1dda78982b">
    <name>ЗаказПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e68cfa9f-a198-4db0-b33e-480ff9fb854b">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c067e5d2-9a4a-46cc-b7ba-cc5d39841051">
    <name>НазначениеПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b5bd8a-a202-4ee3-a07e-d2244bd4d2bb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bba76997-9f21-401b-ae65-37cef98dda2a">
    <name>ОбособленноеОбеспечениеМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6df6fc76-a3cd-4de0-a023-25f5c09faf10">
    <name>НачатьНеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="191fc3ee-3065-4648-ad89-72b3cbf6a108">
    <name>ДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb924568-6ab5-4bc3-9ed4-53888e5a2470">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eeb90a1d-fe9d-4d2c-9f7b-1bae6a5317b2">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a5e505-c602-47c9-9dd8-4b109bf0874f">
    <name>ДинамическаяСтруктура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c294200d-e023-448f-bc98-02cfabea5b0d">
    <name>УкрупненныйЗаказПоНазначениямПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_Этаж</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="404e1a8a-c6a1-46fb-8fba-6480a129a9b2">
    <name>ДоговорНеОбязателен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01fbf6b7-c4b6-4173-a0e2-5e454a3980f7">
    <name>ДатаПотребностиУказываетсяВСтроках</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7a6e457f-9de3-483b-9f11-8235c0db3365">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="233b5572-d99b-45e9-a762-f4936b94aac4">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a32405d7-b213-4b91-8842-bc3b27c23a17">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f6dddb67-6919-4a89-9265-9a486b1adc13">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fb6ec89-8b54-4467-a7ee-20b1f54a8233">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c67ff09-dc6c-4f19-911a-2976ef5313b3">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbacbd26-236a-47f5-bb88-9d9c18122600">
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ce2f7918-6eb6-44a1-9703-eaa30ed728d8">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a65c298-0b01-4992-9536-0f68782c88a3">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8bec9438-5df6-40c3-b8e7-9f215d521294">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="31cf0d4b-bc85-4403-9def-9a0943d6cf54">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f3fdba30-a333-460d-ba0e-4df1604b8439">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="164c9f1e-c498-4657-8d77-c67959ec545e">
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c420c750-bfd8-4a31-8040-84765c9c2998">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Расш1_Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="cdf737d9-9b24-4864-95cf-cd1edb6e9b02">
      <name>ДатаПотребности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57507687-e857-4627-84a6-131b6dc5555a">
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e654eb8f-cadf-4ea9-b106-6855158dcb94">
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="898c017b-174f-4670-8146-5c6e75af51c1">
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d257be95-baab-4cf8-b5ae-541216c91b07">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Documents/ЗаказНаПроизводство2_2/ObjectModule.bsl
&Перед("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.ДатаПотребности = Дата(1,1,1) Тогда
		Сообщить("Заполните желаемую дату выпуска");
		Отказ = Истина;
	КонецЕсли;
	

КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура Расш1_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
///
	Если Не СкладыСервер.ИспользоватьСкладскиеПомещения(СХК_Склад,Дата) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СХК_Этаж");
	КонецЕсли;
///
	ПланируетсяГрафикПроизводства = УправлениеПроизводствомПовтИсп.ИспользуетсяГрафикПроизводства();
	
	ДатаПотребностиОбязательна = ДинамическаяСтруктура И Не ПланируетсяГрафикПроизводства
		ИЛИ Не ДинамическаяСтруктура И РазмещениеВыпуска = Перечисления.СпособыПривязкиОперацийПроизводства.КОкончанию;
		
#Область Шапка	
	
	// Подразделение-диспетчер
	Если ЗначениеЗаполнено(Подразделение) 
		И ПроизводствоСерверПовтИсп.ПараметрыПроизводственногоПодразделения(Подразделение).ПодразделениеДиспетчер <> Истина Тогда
		ТекстОшибки = НСтр("ru = 'Подразделением, ответственным за выполнение заказа, должно быть подразделение-диспетчер';
							|en = 'Dispatching unit should be a business unit responsible for the order fulfillment'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"Подразделение", "Объект", Отказ);
	КонецЕсли;
	
	// Желаемая дата, начать не ранее, размешение выпуска
	МассивНепроверяемыхРеквизитов.Добавить("ДатаПотребности");
	
	Если Не ДатаПотребностиУказываетсяВСтроках
		И (ДатаПотребностиОбязательна И Не ЗначениеЗаполнено(ДатаПотребности)) Тогда
		ТекстОшибки = НСтр("ru = 'Желаемая дата выпуска не заполнена';
							|en = 'Requested release date is unfilled'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"ДатаПотребностиНаФорме",, Отказ);
	КонецЕсли;
	
	Если НЕ ДатаПотребностиУказываетсяВСтроках
		И (НачатьНеРанее > ДатаПотребности И ЗначениеЗаполнено(НачатьНеРанее) И ЗначениеЗаполнено(ДатаПотребности)) Тогда
		ТекстОшибки = НСтр("ru = 'Желаемая дата выпуска меньше даты начала производства';
							|en = 'Required release date is earlier than the production start date'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"ДатаПотребностиНаФорме",, Отказ);
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.Формируется Или ДинамическаяСтруктура Тогда
		МассивНепроверяемыхРеквизитов.Добавить("РазмещениеВыпуска");
	КонецЕсли;
	
	// Давальческое производство
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СобственноеПроизводство Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Партнер");
		МассивНепроверяемыхРеквизитов.Добавить("Договор");
	Иначе
		Если ДоговорНеОбязателен Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Договор");
		КонецЕсли;
	КонецЕсли;
	
	// Назначение выходных изделий получаемых в результате разборки должно быть заполнено в давальческой схеме.
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья2_5
			//++ Устарело_Переработка24
			И ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья
			//-- Устарело_Переработка24
			И Истина
		ИЛИ НЕ НазначениеУказываетсяВШапкеДокумента() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НазначениеПродукция");
	КонецЕсли;
	
	// Способ распределения затрат на выходные изделия должен быть заполнен только для заказов
	// с типом процесса "Без спецификаций"
	Если ТипПроизводственногоПроцесса <> Перечисления.ТипыПроизводственныхПроцессов.БезСпецификаций Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СпособРаспределенияЗатратНаВыходныеИзделия");
	КонецЕсли;

#КонецОбласти	
	
#Область Продукция
	
	// Проверка табличной части "Продукция"

	ЗаголовокТЧ = ПроизводствоКлиентСервер.ЗаголовокТабличнойЧастиПоТипуПроцесса(ТипПроизводственногоПроцесса);
	
	Если Не ЗначениеЗаполнено(Продукция) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не заполнена табличная часть ""%1""';
										|en = 'Table ""%1"" is not filled in'"), ЗаголовокТЧ);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Продукция",, Отказ);
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Продукция");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.Номенклатура");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.Характеристика");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.Склад");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.Подразделение");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.Назначение");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.Спецификация");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.ДатаПотребности");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.ПричинаОтмены");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.КоличествоУпаковок");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.Количество");
	МассивНепроверяемыхРеквизитов.Добавить("Продукция.ДоляСтоимости");
	
	// Детальная проверка строк табличной части "Продукция"
	
	РеквизитыНоменклатуры = Новый Соответствие;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СправочникНоменклатура.Ссылка КАК Номенклатура,
		|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	СправочникНоменклатура.ВестиУчетПоГТД КАК ВестиУчетПоГТД,
		|	СправочникНоменклатура.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик В (
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры),
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры),
		|				ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ХарактеристикиИспользуются
		|
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|ГДЕ
		|	СправочникНоменклатура.Ссылка В (&МассивСсылок)");
	Запрос.УстановитьПараметр("МассивСсылок", Продукция.ВыгрузитьКолонку("Номенклатура"));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИменаРеквизитов		= "ТипНоменклатуры, ХарактеристикиИспользуются, ВестиУчетПоГТД, ПрослеживаемыйТовар";
		ЗначенияРеквизитов	= Новый Структура(ИменаРеквизитов);
		
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Выборка);
		РеквизитыНоменклатуры.Вставить(Выборка.Номенклатура, ЗначенияРеквизитов);
	КонецЦикла;
	
	ХарактеристикиИспользуются = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	
	ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД =
		ПолучитьФункциональнуюОпцию("ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД");
	
	ШаблонАдреса = НСтр("ru = 'в строке %1 списка ""%2""';
						|en = 'in line %1 of the ""%2"" list'");
	ШаблонГТД = НСтр("ru = 'В строке %1 списка ""%2"" выбрана номенклатура, для которой ведется учет по ГТД.
		|При включенной опции ""Запретить оформление операций с импортными товарами без номеров ГТД"" выбор такой номенклатуры запрещен.';
		|en = 'Items with CCD records are selected in line %1 of the %2 list. 
		|you cannot select such products while the ""Prohibit registration of operations with imported goods without CCD numbers"" option is enabled.'");
	
	Для Каждого Строка Из Продукция Цикл
		
		АдресОшибки = СтрШаблон(ШаблонАдреса, Строка.НомерСтроки, ЗаголовокТЧ);
		
		// Проверка заполнения колонки "Номенклатура"
		Если Строка.Номенклатура.Пустая() Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Номенклатура""';
									|en = 'Column ""Items"" is not filled in'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Номенклатура");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки,ЭтотОбъект,Поле,,Отказ);
			Продолжить;
		КонецЕсли;
		
		// Проверка правильности выбора изделий при учете по ГТД
		Если Не Строка.Номенклатура.Пустая()
			И ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД
			И РеквизитыНоменклатуры[Строка.Номенклатура].ВестиУчетПоГТД = Истина
			И Не РеквизитыНоменклатуры[Строка.Номенклатура].ПрослеживаемыйТовар = Истина
			И (РеквизитыНоменклатуры[Строка.Номенклатура].ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар
				ИЛИ РеквизитыНоменклатуры[Строка.Номенклатура].ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонГТД,
				Строка.НомерСтроки,
				ЗаголовокТЧ);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Номенклатура");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,ЭтотОбъект, Поле,,Отказ);
			
		КонецЕсли;
		
		// Проверка заполнения колонки "Характеристика"
		Если ХарактеристикиИспользуются И РеквизитыНоменклатуры[Строка.Номенклатура].ХарактеристикиИспользуются
			И Строка.Характеристика.Пустая() Тогда
			
			ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Характеристика""';
									|en = 'Column ""Variant"" is not filled in'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Характеристика");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки,ЭтотОбъект,Поле,, Отказ);
			
		КонецЕсли;
		
		// Проверка заполнения колонки "Назначение"
		Если (ХозяйственнаяОперация = ДавальческаяСхемаКлиентСервер.ХозяйственнаяОперацияДоговора()
				//++ Устарело_Переработка24
				Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья
				//-- Устарело_Переработка24
				Или Ложь)
			И Не НазначениеУказываетсяВШапкеДокумента()
			И Не Строка.Отменено
			И Не РеквизитыНоменклатуры[Строка.Номенклатура].ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара
			И Строка.Назначение.Пустая() Тогда
			
			ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Назначение""';
									|en = 'Column ""Assignment"" is not filled in'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Назначение");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки,ЭтотОбъект,Поле,, Отказ);
			
		КонецЕсли;
		
		// Проверка заполнения колонок "Склад" и "Подразделение"
		Если РеквизитыНоменклатуры[Строка.Номенклатура].ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа Тогда
			
			Если Строка.СписатьНаРасходы Тогда
				
				Если Строка.Подразделение.Пустая() Тогда
					
					ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Подразделение""';
											|en = 'Column ""Business unit"" is not filled in'");
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Подразделение");
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки,ЭтотОбъект,Поле,, Отказ);
					
				КонецЕсли;
			Иначе
				
				Если Строка.Склад.Пустая() Тогда
					
					ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Склад""';
											|en = 'Column ""Warehouse"" is not filled in'");
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Склад");
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки,ЭтотОбъект,Поле,, Отказ);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ТипПроизводственногоПроцесса <> Перечисления.ТипыПроизводственныхПроцессов.Сборка
				И ТипПроизводственногоПроцесса <> Перечисления.ТипыПроизводственныхПроцессов.БезСпецификаций Тогда
				
				ТекстСообщения = НСтр("ru = 'Не допускается указание работы';
										|en = 'It is not allowed to specify work'");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Номенклатура");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки,ЭтотОбъект,Поле,,Отказ);
				
			ИначеЕсли Строка.Подразделение.Пустая() Тогда
				
				ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Подразделение""';
										|en = 'Column ""Business unit"" is not filled in'");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Подразделение");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверка заполнения колонки "Количество"
		Если Строка.Количество = 0 И Не Строка.Отменено Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Количество""';
									|en = 'Column ""Quantity"" is not filled in'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Количество");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки, ЭтотОбъект, Поле,, Отказ);
		КонецЕсли;
			
		// Причина отмены обязательна для заполнения в строках без признака Отменено
		Если Строка.Отменено И Не ЗначениеЗаполнено(Строка.ПричинаОтмены) Тогда
			ТекстСообщения = НСтр("ru = 'Необходимо указать причину отмены';
									|en = 'Cancellation reason is required'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "ПричинаОтмены");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки, ЭтотОбъект, Поле,, Отказ);
		КонецЕсли;
		
		// Проверка заполнения колонки "Спецификация"
		Если ДинамическаяСтруктура И Строка.Спецификация.Пустая() И Не Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.Формируется Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Спецификация""';
									|en = 'Column ""BOM"" is not filled in'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "Спецификация");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки, ЭтотОбъект, Поле,, Отказ);
		КонецЕсли;

		// Проверка заполнения колонки "Дата потребности"
		Если ДатаПотребностиУказываетсяВСтроках И ДатаПотребностиОбязательна И Не ЗначениеЗаполнено(Строка.ДатаПотребности) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Желаемая дата""';
									|en = 'The ""Requested date"" column is not filled'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "ДатаПотребности");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки, ЭтотОбъект, Поле,, Отказ);
		КонецЕсли;
		
		// Проверка соответствия дат "Начать не ранее" и "Дата потребности"
		Если ДатаПотребностиУказываетсяВСтроках И НачатьНеРанее > Строка.ДатаПотребности И ЗначениеЗаполнено(НачатьНеРанее) И ЗначениеЗаполнено(Строка.ДатаПотребности) Тогда
			ТекстСообщения = НСтр("ru = 'Желаемая дата выпуска меньше даты начала производства';
									|en = 'The required release date is earlier than the production start date'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "ДатаПотребности");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки, ЭтотОбъект, Поле,, Отказ);
		КонецЕсли;
		
		// Проверка заполнения колонки "Доля стоимости"
		Если ТипПроизводственногоПроцесса = Перечисления.ТипыПроизводственныхПроцессов.БезСпецификаций
			И ПроизводствоСервер.ТребуетсяЗаполнитьДолюСтоимости(ЭтотОбъект, Строка) Тогда
			
			ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Доля стоимости""';
									|en = 'Column ""Cost share"" is not filled in'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Продукция", Строка.НомерСтроки, "ДоляСтоимости");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения + " " + АдресОшибки, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СобственноеПроизводство
			И (ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоИзДавальческогоСырья2_5")
				//++ Устарело_Переработка24
				Или ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоИзДавальческогоСырья")
				//-- Устарело_Переработка24
				Или Ложь) Тогда
		ПроверитьДавальческиеНазначенияВТЧПродукция(Отказ); // нужна проверка указания давальческих назначений.
	КонецЕсли;
 	
	ПараметрыВыбораСтатейИАналитик = Документы.ЗаказНаПроизводство2_2.ПараметрыВыбораСтатейИАналитик(ЭтотОбъект);
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ИмяТЧ = "Продукция";
	НоменклатураСервер.ПроверитьОкруглениеКоличества(ЭтотОбъект, Отказ, ПараметрыПроверки);

#КонецОбласти	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ЗаказНаПроизводство2_2Локализация.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);

КонецПроцедуры
